backend/controllers/BookingController.php

SELECT * FROM `menu` WHERE `id`='1'
SELECT * FROM `items` WHERE `id`='32'
SELECT COUNT(*) FROM `booking_items` WHERE (`booking_id`=4) AND (`menu_id`=1) AND (`item_id`=32)
---
    public function actionView($id) {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }
        if (empty(Yii::$app->BackFunctions->checkaccess(Yii::$app->controller->action->id, Yii::$app->controller->id))) {
            throw new \yii\web\HttpException('403', Yii::$app->params['permission_message']);
        }
        $model = $this->findModel($id);
        $booking_menu = explode(",", $model->menu);
        if ($booking_menu) {
            foreach ($booking_menu as $value) {
                $menu_data = Menu::find()->where(['id' => $value])->one();
                if ($menu_data) {
                    $menu_items = explode(",", $menu_data->items);
                    foreach ($menu_items as $items) {
                        $items_data = Items::find()->where(['id' => $items])->one();
                        if($items_data){
                            $BookingItemsModel_update = BookingItems::find()->where(['booking_id'=>$model->id, 'menu_id' => $menu_data->id, 'item_id' => $items_data->id])->count();

SELECT * FROM `booking_items` WHERE (`booking_id`='4') AND (`menu_id`='1') AND (`item_id`='32')
SELECT EXISTS(SELECT * FROM `items` WHERE `items`.`id`='32')
UPDATE `booking_items` SET `booking_id`=4, `menu_id`=3, `item_id`=178, `weight`='323', `unit`='Kilogram' WHERE `id`=10
---
    public function actionItemweight(){
        if (Yii::$app->user->isGuest) {
            return false;
        }
        $request = Yii::$app->request;
        if ($request->isAjax) {
            $BookingItems = $request->post('BookingItems', '');
            if($BookingItems){
                $booking_id = $BookingItems['booking_id'];
                $menu_id = $BookingItems['menu_id'];
                $item_id = $BookingItems['item_id'];
                $weight = $BookingItems['weight'];
                $unit = $BookingItems['unit'];
                $model = BookingItems::find()->where(['booking_id'=>$booking_id, 'menu_id' => $menu_id, 'item_id' => $item_id])->one();
                if ($model && $model->load(Yii::$app->request->post())) {
                    $model->save();

SELECT * FROM `booking` WHERE `id`='4'
---
    protected function findModel($id) {
        if (($model = Booking::findOne($id)) !== null) {