backend/controllers/BookingController.php

SELECT * FROM `booking` WHERE `id`='18'
---
    protected function findModel($id) {
        if (($model = Booking::findOne($id)) !== null) {