backend/controllers/SiteController.php

    public function actionIndex() {
        if (empty(Yii::$app->BackFunctions->checkaccess(Yii::$app->controller->action->id, Yii::$app->controller->id))) {
            throw new \yii\web\HttpException('403', Yii::$app->params['permission_message']);
        }
        $booking = Booking::find()->where(['status' => 'Approved'])->count();
        $booking_paid = Booking::find()->where(['status' => 'Paid'])->count();
---
SELECT COUNT(*) FROM `booking` WHERE `status`='Approved'
SELECT COUNT(*) FROM `booking` WHERE `status`='Paid'