backend/views/role/access.php

                            if ($permissionmodel) {
                                $i = 0;
                                foreach ($permissionmodel as $key => $value) {
                                    $RoleAccess = RoleAccess::find()->where(['role_id' => $rolemodel->id, 'permission_id' => $value['id']])->one();
---
SELECT * FROM `role_access` WHERE (`role_id`=1) AND (`permission_id`='21')