frontend/controllers/SiteController.php

    public function actionReview() {
        global $sg;
        $request = Yii::$app->request;

        $model = new Review();
        if ($request->isAjax && $model->load(Yii::$app->request->post())) {
            $model->status = 'Active';
            $model->status_at = Yii::$app->FrontFunctions->currentDateTime();
            $model->created_at = Yii::$app->FrontFunctions->currentDateTime();
            $model->updated_at = Yii::$app->FrontFunctions->currentDateTime();
            if (!$model->save()) {
---
INSERT INTO `review` (`name`, `email`, `subject`, `message`, `rating`, `status`, `status_at`, `created_at`, `updated_at`) VALUES ('test2', 'test2@gmail.com', 'test', 'test', 2, 'Active', '2021-09-07 21:37:30', '2021-09-07 21:37:30', '2021-09-07 21:37:30')