backend/views/layouts/main.php

SELECT * FROM `modules` WHERE ((`menu_id`=0) AND (`parent_menu_id`=0) AND (`parent_submenu_id`=0)) AND (`title` != '')
---
                        <nav class="mt-2">
                            <?php
                            $sideMenu = array();
                            $modules = Modules::find()->where(['menu_id' => 0, 'parent_menu_id' => 0, 'parent_submenu_id' => 0])->andWhere(['!=', 'title', ''])->all();

SELECT * FROM `modules` WHERE ((`type`='Menu') AND (`menu_id`=1) AND (`status`='Active')) AND (`title` != '') ORDER BY `menu_position`
---

                                    //$sideMenu[] = '<li class="nav-header">'.$value['title'].'</li>';

                                    $menus = Modules::find()->where(['type' => 'Menu', 'menu_id' => $value['id'], 'status' => 'Active'])->andWhere(['!=', 'title', ''])->orderBy(['menu_position' => SORT_ASC])->all();

SELECT * FROM `modules` WHERE ((`type`='Submenu') AND (`menu_id`=1) AND (`parent_menu_id`=5) AND (`status`='Active')) AND (`title` != '') ORDER BY `submenu_position`
---
                                            }
                                            $childMenu = "";
                                            $icon = "";
                                            $submenu = Modules::find()->where(['type' => 'Submenu', 'menu_id' => $value['id'], 'parent_menu_id' => $value_menu['id'], 'status' => 'Active'])->andWhere(['!=', 'title', ''])->orderBy(['submenu_position' => SORT_ASC])->all();

SELECT * FROM `modules` WHERE ((`type`='Subsubmenu') AND (`menu_id`=2) AND (`parent_menu_id`=14) AND (`parent_submenu_id`=15) AND (`status`='Active')) AND (`title` != '') ORDER BY `submenu_position`
---
                                                    }
                                                    $iconchild = "";
                                                    $childInMenu = "";
                                                    $subsubmenu = Modules::find()->where(['type' => 'Subsubmenu', 'menu_id' => $value['id'], 'parent_menu_id' => $value_menu['id'], 'parent_submenu_id' => $value_submenu['id'], 'status' => 'Active'])->andWhere(['!=', 'title', ''])->orderBy(['submenu_position' => SORT_ASC])->all();