frontend/components/BaseController.php

SELECT * FROM `config` WHERE `status`='Active'
---
    public function init() {
        parent::init();
        global $sg, $sconfig;
        $sg = array();
        $sg['base_url'] = $sg['site_url'] = Url::base(true) . '/git/shriganeshcaterers';
        $sg['base_path'] = $sg['site_path'] = '/git/shriganeshcaterers/';
        $user = Yii::$app->user->identity;
        $sg['user'] = $user;
        $configdata = Config::find()->where(['status' => 'Active'])->asArray()->all();