frontend/components/SqlFunctions.php

SELECT * FROM `categories` WHERE `status`='Active'
---
    function categories($condition = "") {
        if($condition){
            return Categories::find()->where(['status' => 'Active'])->andWhere($condition)->asArray()->one();
        }
        return Categories::find()->where(['status' => 'Active'])->asArray()->all();

SELECT * FROM `menu` WHERE `status`='Active'
---
    function menu($condition = "") {
        if($condition){
            return Menu::find()->where(['status' => 'Active'])->andWhere($condition)->asArray()->one();
        }
        return Menu::find()->where(['status' => 'Active'])->asArray()->all();

SELECT * FROM `event_categories` WHERE `status`='Active'
---
    function eventCategories($condition = "") {
        if($condition){
            return EventCategories::find()->where(['status' => 'Active'])->andWhere($condition)->asArray()->one();
        }
        return EventCategories::find()->where(['status' => 'Active'])->asArray()->all();

SELECT * FROM `gallery` WHERE (`status`='Active') AND (`type`='Image') ORDER BY `id` DESC
SELECT * FROM `gallery` WHERE `status`='Active' ORDER BY `id` DESC LIMIT 8
---
    function gallery($condition = "", $limit = '') {
        if($condition){
            if($limit == 'all'){
                return Gallery::find()->where(['status' => 'Active'])->andWhere($condition)->orderBy(['id' => SORT_DESC])->asArray()->all();
            }
            return Gallery::find()->where(['status' => 'Active'])->andWhere($condition)->orderBy(['id' => SORT_DESC])->asArray()->one();
        }
        if($limit && $limit != 'all'){
            return Gallery::find()->where(['status' => 'Active'])->orderBy(['id' => SORT_DESC])->limit($limit)->asArray()->all();