backend/views/booking/_form.php

/* @var $model backend\models\Booking */
/* @var $form yii\widgets\ActiveForm */

$menuData = Menu::find()->joinWith('menuCategory')->orderBy(['categories.position' => SORT_ASC])->all();
$menu = ArrayHelper::map($menuData, 'id', function($element) {
            $category = '' . $element->menuCategory->id . '-' . $element->menuCategory->gujarati . ' (' . ucfirst($element->menuCategory->english) . ')';
            $item_list = $element->id.'- '.ucfirst($element->english) . ' ';
            return $item_list . ' : ' . $category;
        }, function($element) {
            return $element->menuCategory->id . '-' . $element->menuCategory->gujarati . ' (' . ucfirst($element->menuCategory->english) . ')';
        });
---
SELECT `menu`.* FROM `menu` LEFT JOIN `categories` ON `menu`.`menu_category_id` = `categories`.`id` ORDER BY `categories`.`position`
SELECT * FROM `categories` WHERE `id` IN (15, 9, 6, 8, 11, 13, 3, 2, 7, 10, 22, 4, 16, 1, 14, 12, 28, 5)