backend/views/booking/_payment_form.php

SELECT `menu`.* FROM `menu` LEFT JOIN `categories` ON `menu`.`menu_category_id` = `categories`.`id` WHERE `menu`.`id` IN ('1', '8', '20', '29', '3', '32', '51', '109', '28', '38', '80') ORDER BY `categories`.`position`, `menu`.`english`
SELECT * FROM `categories` WHERE `id` IN (10, 1, 14, 12, 5)
---
$dnone = ($model->payment_type == 'Partial') ? 'block' : 'none';

$model->menu = explode(",", $model->menu);
$menuData = Menu::find()->joinWith('menuCategory')->where(['IN', 'menu.id', $model->menu])->orderBy(['categories.position' => SORT_ASC, 'menu.english' => SORT_ASC])->all();

$menu = ArrayHelper::map($menuData, 'id', function($element) {
            $category = $element->menuCategory->gujarati . ' (' . ucfirst($element->menuCategory->english) . ')';
            $item_list = ucfirst($element->english) . ' ';
//            return $item_list . ' : ' . $category;
            return $item_list;
        }, function($element) {
            return $element->menuCategory->gujarati . ' (' . ucfirst($element->menuCategory->english) . ')';
        });