backend/views/booking/_print_data.php

use backend\models\Menu;
use backend\models\BookingItems;

$singlemenu = Menu::find()->where(['status' => 'Active'])->andWhere(['id' => $menu_id])->one();
$category = '' . $singlemenu->menuCategory->id . '-' . $singlemenu->menuCategory->gujarati . ' (' . ucfirst($singlemenu->menuCategory->english) . ')';

$BookingItems = BookingItems::find()->joinWith('menuCategory')->where(['booking_items.booking_id' => $booking_id, 'booking_items.menu_id'=>$menu_id])->orderBy(['categories.position' => SORT_ASC])->all();
---
SELECT * FROM `menu` WHERE (`status`='Active') AND (`id`=3)
SELECT `booking_items`.* FROM `booking_items` LEFT JOIN `categories` ON `booking_items`.`menu_category_id` = `categories`.`id` WHERE (`booking_items`.`booking_id`=18) AND (`booking_items`.`menu_id`=3) ORDER BY `categories`.`position`