backend/views/booking/view.php

                                'containerOptions' => ['style' => 'overflow: auto'], // only set when $responsive = false
                                'headerRowOptions' => ['class' => 'kartik-sheet-style'],
                                'filterRowOptions' => ['class' => 'kartik-sheet-style'],
                                'columns' => [
                                    [
                                        'class' => 'kartik\grid\SerialColumn',
                                        'contentOptions' => ['class' => 'kartik-sheet-style'],
                                        'width' => '36px',
                                        'header' => 'No',
                                        'headerOptions' => ['class' => 'kartik-sheet-style']
                                    ],
                                    [
                                        'attribute' => 'menu_id',
                                        'label' => 'Menu',
                                        'vAlign' => 'middle',
                                        'hAlign' => 'left',
                                        'format' => 'raw',
                                        'filter' => ArrayHelper::map(Menu::find()->where(['status' => 'Active'])->asArray()->all(), 'id', 'english'),
                                        'value' => function ($model, $key, $index, $widget) {
                                            return $model->menu->english;
                                        },
                                    ],
                                    [
                                        'attribute' => 'item_id',
                                        'label' => 'Items',
---
SELECT * FROM `menu` WHERE `id`=3
SELECT * FROM `items` WHERE `id`=449
SELECT * FROM `menu` WHERE `id`=1
SELECT * FROM `menu` WHERE `status`='Active'