backend/views/booking/view.php

$this->params['breadcrumbs'][] = $this->title;
\yii\web\YiiAsset::register($this);

$CategoryData = ArrayHelper::map(Categories::find()->where(['status' => 'Active'])->orderBy(['position' => SORT_ASC])->all(), 'id', function($element) {
            return $element->id . '- ' . ucfirst($element->gujarati) . ' (' . $element->english . ')';
        });
---
SELECT * FROM `categories` WHERE `status`='Active' ORDER BY `position`

                return $element->id . '- ' . ucfirst($element->english) . ' (' . $element->menuCategory->gujarati . ')';
            });
} else {
    $MenuData = ArrayHelper::map(Menu::find()->joinWith('menuCategory')->orderBy(['categories.position' => SORT_ASC])->where(['menu.status' => 'Active'])->all(), 'id', function($element) {
                return $element->id . '- ' . ucfirst($element->english) . ' (' . $element->menuCategory->gujarati . ')';
            }
    );
}
if ($searchModel && $searchModel->item_category_id) {
    $ItemsData = ArrayHelper::map(Items::find()->where(['status' => 'Active', 'item_category_id' => $searchModel->item_category_id])->orderBy(['id' => SORT_ASC])->all(), 'id', function($element) {
                return $element->id . '- ' . ucfirst($element->gujarati);
            });
} else {
    $ItemsData = ArrayHelper::map(Items::find()->where(['status' => 'Active'])->orderBy(['id' => SORT_ASC])->all(), 'id', function($element) {
                return $element->id . '- ' . ucfirst($element->gujarati);
            });
---
SELECT `menu`.* FROM `menu` LEFT JOIN `categories` ON `menu`.`menu_category_id` = `categories`.`id` WHERE `menu`.`status`='Active' ORDER BY `categories`.`position`
SELECT * FROM `categories` WHERE `id` IN (15, 9, 6, 8, 11, 13, 3, 2, 7, 10, 22, 4, 16, 1, 14, 12, 28, 5)
SELECT * FROM `items` WHERE (`status`='Active') AND (`item_category_id`='1') ORDER BY `id`
SELECT * FROM `items` WHERE `status`='Active' ORDER BY `id`

            return '<strong>' . $model->item->gujarati . '</strong>';
        },
    ],
    [
        'attribute' => 'item_category_id',
        'label' => 'Item Category',
        'vAlign' => 'middle',
        'hAlign' => 'left',
        'format' => 'raw',
        'filter' => ArrayHelper::map(ItemsCategories::find()->where(['status' => 'Active'])->asArray()->all(), 'id', 'gujarati'),
        'filterInputOptions' => ['class' => 'form-select'],
        'value' => function ($model, $key, $index, $widget) {
            return $model->itemCategory->gujarati;
        },
    ],
---
SELECT * FROM `items` WHERE `status`='Active'
SELECT * FROM `items_categories` WHERE `id`=1
SELECT * FROM `items_categories` WHERE `status`='Active'

                        $html_menu_list_menu = '';
                        $model->menu = explode(",", $model->menu);
                        if ($model->menu) {
                            $menuData = Menu::find()->joinWith('menuCategory')->where(['IN', 'menu.id', $model->menu])->orderBy(['categories.position' => SORT_ASC, 'menu.english' => SORT_ASC])->all();
                            $menu = ArrayHelper::map($menuData, 'id', function($element) {
                                        $category = $element->menuCategory->gujarati . ' (' . ucfirst($element->menuCategory->english) . ')';
                                        $item_list = ucfirst($element->english) . ' ';
                                        //            return $item_list . ' : ' . $category;
                                        return $item_list;
                                    }, function($element) {
                                        return $element->menuCategory->gujarati . ' (' . ucfirst($element->menuCategory->english) . ')';
                                    });
---
SELECT `menu`.* FROM `menu` LEFT JOIN `categories` ON `menu`.`menu_category_id` = `categories`.`id` WHERE `menu`.`id` IN ('3', '1', '25') ORDER BY `categories`.`position`, `menu`.`english`
SELECT * FROM `categories` WHERE `id` IN (1, 14)