backend/components/BackFunctions.php

    public function checkaccess($action = "", $controller = "") {
        global $vm;
        $adminuser = $vm['admin'];
        if ($action && $controller) {
            $modulesdata = Modules::find()->where(['status' => 'Active', 'controller' => $controller, 'action' => $action])->one();
            if (empty($modulesdata)) {
                $modulesdata = Modules::find()->where(['status' => 'Active', 'controller' => $controller])->one();
            }
            if ($modulesdata) {
                $permission = Permission::find()->where(['module_id' => $modulesdata->id, 'controller' => $controller])->andWhere(['or', ['action' => $action], ['name' => $action]])->one();
                if ($permission) {
                    $module_access = RoleAccess::find()->where(['role_id' => $adminuser->role_id, 'permission_id' => $permission->id, 'access' => '1'])->one();
---
SELECT * FROM `modules` WHERE (`status`='Active') AND (`controller`='booking') AND (`action`='view')
SELECT * FROM `modules` WHERE (`status`='Active') AND (`controller`='booking')
SELECT * FROM `permission` WHERE ((`module_id`=25) AND (`controller`='booking')) AND ((`action`='view') OR (`name`='view'))
SELECT * FROM `role_access` WHERE (`role_id`=1) AND (`permission_id`=98) AND (`access`='1')